---
kind: type
id: T:Autodesk.Revit.DB.FittingAndAccessoryCalculationType
source: html/6bc45325-d5e3-c389-d30a-39a3e6799103.htm
---
# Autodesk.Revit.DB.FittingAndAccessoryCalculationType

The MEP fitting and accessory pressure drop calculation type.

## Syntax (C#)
```csharp
public enum FittingAndAccessoryCalculationType
```